# Pandas Part II

In [5]:
import numpy as np
import numpy.random as npr
import pandas as pd

In [6]:
# make a dataframe from a dict
df = pd.DataFrame({'A':range(15), 'B': range(16,31)})
df

     A   B
0    0  16
1    1  17
2    2  18
3    3  19
4    4  20
5    5  21
6    6  22
7    7  23
8    8  24
9    9  25
10  10  26
11  11  27
12  12  28
13  13  29
14  14  30

In [8]:
# add a column
df['C'] = [0,1,4,9,16,25,36,49,64,81,100,121,144,169,196]
df.head()

   A   B   C
0  0  16   0
1  1  17   1
2  2  18   4
3  3  19   9
4  4  20  16

In [9]:
# change value(s) (cubes)
df['C'][[1,3,5]] = [1,27,125]
df.head()

   A   B   C
0  0  16   0
1  1  17   1
2  2  18   4
3  3  19  27
4  4  20  16

In [14]:
df2 = pd.DataFrame(npr.standard_normal(15).reshape(3,5))

In [12]:
mask = df2 < 0
mask
df2

          0         1         2         3         4
0  0.845261  1.049298  0.104647 -0.358157 -0.171145
1  1.627177 -1.020508 -1.777756 -0.378931  0.077294
2 -1.361304  0.369486  1.850349 -0.035000 -0.318568

In [13]:
df2[mask] = 0
df2

          0         1         2    3         4
0  0.845261  1.049298  0.104647  0.0  0.000000
1  1.627177  0.000000  0.000000  0.0  0.077294
2  0.000000  0.369486  1.850349  0.0  0.000000

In [16]:
np.where(df2<0, 0, df2)

array([[0.18539337, 0.28647713, 0.09381726, 0.        , 0.30379696],
       [1.02742303, 0.        , 0.50788695, 0.85285275, 0.        ],
       [0.        , 1.06766658, 1.02921664, 0.51119596, 0.44870617]])

In [20]:
df.median()

A     7.0
B    23.0
C    64.0
dtype: float64

In [21]:
df.describe()

               A          B           C
count  15.000000  15.000000   15.000000
mean    7.000000  23.000000   75.533333
std     4.472136   4.472136   64.229351
min     0.000000  16.000000    0.000000
25%     3.500000  19.500000   21.500000
50%     7.000000  23.000000   64.000000
75%    10.500000  26.500000  123.000000
max    14.000000  30.000000  196.000000

In [22]:
index = npr.randint(2008, 2018,size=100)
df3 = pd.DataFrame(npr.normal(100,15, size=100))
df3.set_index(index,inplace=True)

In [23]:
df3.head()

               0
2017  104.500840
2013   86.673174
2010   76.679527
2009  100.023380
2009  126.945441

In [24]:
df3.groupby(index).mean()

               0
2008   98.600965
2009   95.203313
2010   99.393491
2011  101.170938
2012   96.241358
2013  101.446221
2014  108.121172
2015   98.247437
2016   97.452426
2017   92.587211